gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/memcfg.h
    if(claMemType == MEMCFG_CLA_MEM_PROGRAM)
    {
        // Program memory
        HWREG(MEMCFG_BASE + MEMCFG_O_LSXCLAPGM) |= ramSections;
    }
    else
    {
        // Data memory
        HWREG(MEMCFG_BASE + MEMCFG_O_LSXCLAPGM) &= ~ramSections;
    }

    EDIS;
}

//*****************************************************************************
//
//! Enables individual RAM access violation interrupt sources.
//!
//! \param intFlags is a bit mask of the interrupt sources to be enabled.
//! Can be a logical OR any of the following values:
//!  - \b MEMCFG_NMVIOL_CPUREAD
//!  - \b MEMCFG_NMVIOL_CPUWRITE
//!  - \b MEMCFG_NMVIOL_CPUFETCH
//!  - \b MEMCFG_NMVIOL_DMAWRITE
//!  - \b MEMCFG_NMVIOL_CLA1READ
//!  - \b MEMCFG_NMVIOL_CLA1WRITE
//!  - \b MEMCFG_NMVIOL_CLA1FETCH
//!  - \b MEMCFG_MVIOL_CPUFETCH
//!  - \b MEMCFG_MVIOL_CPUWRITE
//!  - \b MEMCFG_MVIOL_DMAWRITE
//!
//! This function enables the indicated RAM access violation interrupt sources.
//! Only the sources that are enabled can be reflected to the processor
//! interrupt; disabled sources have no effect on the processor.
//!
//! \return None.
//
//*****************************************************************************
static inline void
MemCfg_enableViolationInterrupt(uint32_t intFlags)
{
    //
    // Enable the specified interrupts.
    //
    EALLOW;

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_NMAVINTEN) |=
        intFlags & MEMCFG_NMVIOL_MASK;

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_MAVINTEN) |=
        (intFlags & MEMCFG_MVIOL_MASK) >> MEMCFG_MVIOL_SHIFT;

    EDIS;
}

//*****************************************************************************
//
//! Disables individual RAM access violation interrupt sources.
//!
//! \param intFlags is a bit mask of the interrupt sources to be disabled.
//! Can be a logical OR any of the following values:
//!  - \b MEMCFG_NMVIOL_CPUREAD
//!  - \b MEMCFG_NMVIOL_CPUWRITE
//!  - \b MEMCFG_NMVIOL_CPUFETCH
//!  - \b MEMCFG_NMVIOL_DMAWRITE
//!  - \b MEMCFG_NMVIOL_CLA1READ
//!  - \b MEMCFG_NMVIOL_CLA1WRITE
//!  - \b MEMCFG_NMVIOL_CLA1FETCH
//!  - \b MEMCFG_MVIOL_CPUFETCH
//!  - \b MEMCFG_MVIOL_CPUWRITE
//!  - \b MEMCFG_MVIOL_DMAWRITE
//!
//! This function disables the indicated RAM access violation interrupt
//! sources. Only the sources that are enabled can be reflected to the
//! processor interrupt; disabled sources have no effect on the processor.
//!
//! \note Note that only non-master violations may generate interrupts.
//!
//! \return None.
//
//*****************************************************************************
static inline void
MemCfg_disableViolationInterrupt(uint32_t intFlags)
{
    //
    // Disable the specified interrupts.
    //
    EALLOW;

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_NMAVINTEN) &=
        ~(intFlags & MEMCFG_NMVIOL_MASK);

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_MAVINTEN) &=
        ~((intFlags & MEMCFG_MVIOL_MASK) >> MEMCFG_MVIOL_SHIFT);

    EDIS;
}

//*****************************************************************************
//
//! Gets the current RAM access violation status.
//!
//! This function returns the RAM access violation status. This function will
//! return flags for both master and non-master access violations although only
//! the non-master flags have the ability to cause the generation of an
//! interrupt.
//!
//! \return Returns the current violation status, enumerated as a bit field of
//! the values:
//!  - \b MEMCFG_NMVIOL_CPUREAD
//!  - \b MEMCFG_NMVIOL_CPUWRITE
//!  - \b MEMCFG_NMVIOL_CPUFETCH
//!  - \b MEMCFG_NMVIOL_DMAWRITE
//!  - \b MEMCFG_NMVIOL_CLA1READ
//!  - \b MEMCFG_NMVIOL_CLA1WRITE
//!  - \b MEMCFG_NMVIOL_CLA1FETCH
//!  - \b MEMCFG_MVIOL_CPUFETCH
//!  - \b MEMCFG_MVIOL_CPUWRITE
//!  - \b MEMCFG_MVIOL_DMAWRITE
//
//*****************************************************************************
static inline uint32_t
MemCfg_getViolationInterruptStatus(void)
{
    uint32_t status;

    //
    // Read and return RAM access status flags.
    //
    status = (HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_NMAVFLG)) |
             (HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_MAVFLG) <<
              MEMCFG_MVIOL_SHIFT);

    return(status);
}

//*****************************************************************************
//
//! Sets the RAM access violation status.
//!
//! \param intFlags is a bit mask of the access violation flags to be set.
//! Can be a logical OR any of the following values:
//!  - \b MEMCFG_NMVIOL_CPUREAD
//!  - \b MEMCFG_NMVIOL_CPUWRITE
//!  - \b MEMCFG_NMVIOL_CPUFETCH
//!  - \b MEMCFG_NMVIOL_DMAWRITE
//!  - \b MEMCFG_NMVIOL_CLA1READ
//!  - \b MEMCFG_NMVIOL_CLA1WRITE
//!  - \b MEMCFG_NMVIOL_CLA1FETCH
//!  - \b MEMCFG_MVIOL_CPUFETCH
//!  - \b MEMCFG_MVIOL_CPUWRITE
//!  - \b MEMCFG_MVIOL_DMAWRITE
//!
//! This function sets the RAM access violation status. This function will
//! set flags for both master and non-master access violations, and an
//! interrupt will be generated if it is enabled.
//!
//! \return None.
//
//*****************************************************************************
static inline void
MemCfg_forceViolationInterrupt(uint32_t intFlags)
{
    //
    // Shift and mask the flags appropriately and write them to the
    // corresponding SET register.
    //
    EALLOW;

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_NMAVSET) =
        intFlags & MEMCFG_NMVIOL_MASK;

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_MAVSET) =
        (intFlags & MEMCFG_MVIOL_MASK) >> MEMCFG_MVIOL_SHIFT;

    EDIS;
}

//*****************************************************************************
//
//! Clears RAM access violation flags.
//!
//! \param intFlags is a bit mask of the access violation flags to be cleared.
//! Can be a logical OR any of the following values:
//!  - \b MEMCFG_NMVIOL_CPUREAD
//!  - \b MEMCFG_NMVIOL_CPUWRITE
//!  - \b MEMCFG_NMVIOL_CPUFETCH
//!  - \b MEMCFG_NMVIOL_DMAWRITE
//!  - \b MEMCFG_NMVIOL_CLA1READ
//!  - \b MEMCFG_NMVIOL_CLA1WRITE
//!  - \b MEMCFG_NMVIOL_CLA1FETCH
//!  - \b MEMCFG_MVIOL_CPUFETCH
//!  - \b MEMCFG_MVIOL_CPUWRITE
//!  - \b MEMCFG_MVIOL_DMAWRITE
//!
//! \return None.
//
//*****************************************************************************
static inline void
MemCfg_clearViolationInterruptStatus(uint32_t intFlags)
{
    //
    // Clear the requested access violation flags.
    //
    EALLOW;

    HWREG(ACCESSPROTECTION_BASE + MEMCFG_O_NMAVCLR) |=
        intFlags & MEMCFG_NMVIOL_MASK;

