gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/memcfg.h
    HWREG(MEMORYERROR_BASE + MEMCFG_O_UCERRSET) = stsFlags;

    EDIS;
}

//*****************************************************************************
//
//! Clears correctable RAM error flags.
//!
//! \param stsFlags is a bit mask of the status flags to be cleared.
//! This parameter can be any of the \b MEMCFG_CERR_CPUREAD,
//! \b MEMCFG_CERR_DMAREAD, or \b MEMCFG_CERR_CLA1READ values.
//!
//! This function clears the specified correctable RAM error flags.
//!
//! \return None.
//
//*****************************************************************************
static inline void
MemCfg_clearCorrErrorStatus(uint32_t stsFlags)
{
    //
    // Clear the requested flags.
    //
    EALLOW;

    HWREG(MEMORYERROR_BASE + MEMCFG_O_CERRCLR) |= stsFlags;

    EDIS;
}

//*****************************************************************************
//
//! Clears uncorrectable RAM error flags.
//!
//! \param stsFlags is a bit mask of the status flags to be cleared.
//! This parameter can be any of the \b MEMCFG_UCERR_CPUREAD,
//! \b MEMCFG_UCERR_DMAREAD, or \b MEMCFG_UCERR_CLA1READ values.
//!
//! This function clears the specified uncorrectable RAM error flags.
//!
//! \return None.
//
//*****************************************************************************
static inline void
MemCfg_clearUncorrErrorStatus(uint32_t stsFlags)
{
    //
    // Clear the requested flags.
    //
    EALLOW;

    HWREG(MEMORYERROR_BASE + MEMCFG_O_UCERRCLR) |= stsFlags;

    EDIS;
}

//*****************************************************************************
//
//! Locks the writes to the configuration of specified RAM sections.
//!
//! \param ramSections is the logical OR of the sections to be configured.
//!
//! This function locks writes to the access protection and master select
//! configuration of a RAM section. That means that calling
//! MemCfg_setProtection() or MemCfg_setLSRAMMasterSel() for a locked RAM section
//! will have no effect until MemCfg_unlockConfig() is called.
//!
//! The \e ramSections parameter is logical OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx or \b MEMCFG_SECT_LSX_ALL
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx or \b MEMCFG_SECT_GSX_ALL
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_lockConfig(uint32_t ramSections);

//*****************************************************************************
//
//! Unlocks the writes to the configuration of a RAM section.
//!
//! \param ramSections is the logical OR of the sections to be configured.
//!
//! This function unlocks writes to the access protection and master select
//! configuration of a RAM section that has been locked using
//! MemCfg_lockConfig().
//!
//! The \e ramSections parameter is logical OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx or \b MEMCFG_SECT_LSX_ALL
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx or \b MEMCFG_SECT_GSX_ALL
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_unlockConfig(uint32_t ramSections);

//*****************************************************************************
//
//! Permanently locks writes to the configuration of a RAM section.
//!
//! \param ramSections is the logical OR of the sections to be configured.
//!
//! This function permanently locks writes to the access protection and master
//! select configuration of a RAM section. That means that calling
//! MemCfg_setProtection() or MemCfg_setLSRAMMasterSel() for a locked RAM section
//! will have no effect. To lock the configuration in a nonpermanent way, use
//! MemCfg_lockConfig().
//!
//! The \e ramSections parameter is logical OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx or \b MEMCFG_SECT_LSX_ALL
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx or \b MEMCFG_SECT_GSX_ALL
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_commitConfig(uint32_t ramSections);

//*****************************************************************************
//
//! Sets the access protection mode of a single RAM section.
//!
//! \param ramSection is the RAM section to be configured.
//! \param protectMode is the logical OR of the settings to be applied.
//!
//! This function sets the access protection mode of the specified RAM section.
//! The mode is passed into the /e protectMode parameter as the logical OR of
//! the following values:
//! - \b MEMCFG_PROT_ALLOWCPUFETCH or \b MEMCFG_PROT_BLOCKCPUFETCH - CPU fetch
//! - \b MEMCFG_PROT_ALLOWCPUWRITE or \b MEMCFG_PROT_BLOCKCPUWRITE - CPU write
//! - \b MEMCFG_PROT_ALLOWDMAWRITE or \b MEMCFG_PROT_BLOCKDMAWRITE - DMA write
//!
//! The \e ramSection parameter is one of the following indicators:
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx
//!
//! This function will have no effect if the associated registers have been
//! locked by MemCfg_lockConfig() or MemCfg_commitConfig() or if the memory
//! is configured as CLA program memory.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_setProtection(uint32_t ramSection, uint32_t protectMode);

//*****************************************************************************
//
//! Sets the master of the specified RAM section.
//!
//! \param ramSection is the RAM section to be configured.
//! \param masterSel is the sharing selection.
//!
//! This function sets the master select configuration of the RAM section. If
//! the \e masterSel parameter is \b MEMCFG_LSRAMMASTER_CPU_ONLY, the RAM
//! section passed into the \e ramSection parameter will be dedicated to the
//! CPU. If \b MEMCFG_LSRAMMASTER_CPU_CLA1, the memory section will be shared
//! between the CPU and the CLA.
//!
//! The \e ramSection parameter should be a value from \b MEMCFG_SECT_LS0
//! through \b MEMCFG_SECT_LSx.
//!
//! This function will have no effect if the associated registers have been
//! locked by MemCfg_lockConfig() or MemCfg_commitConfig().
//!
//! \note This API only applies to LSx RAM.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_setLSRAMMasterSel(uint32_t ramSection, MemCfg_LSRAMMasterSel masterSel);

//*****************************************************************************
//
//! Sets the test mode of the specified RAM section.
//!
//! \param ramSection is the RAM section to be configured.
//! \param testMode is the test mode selected.
//!
//! This function sets the test mode configuration of the RAM section. The
//! \e testMode parameter can take one of the following values:
//! - \b MEMCFG_TEST_FUNCTIONAL
//! - \b MEMCFG_TEST_WRITE_DATA
//! - \b MEMCFG_TEST_WRITE_ECC (DxRAM) or MEMCFG_TEST_WRITE_PARITY (LSx, GSx,
//!   or MSGxRAM)
//!
//! The \e ramSection parameter is one of the following indicators:
//! - \b MEMCFG_SECT_M0 or \b MEMCFG_SECT_M1
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx
//! - \b MEMCFG_SECT_MSGCPUTOCLA1 or \b MEMCFG_SECT_MSGCLA1TOCPU
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_setTestMode(uint32_t ramSection, MemCfg_TestMode testMode);

//*****************************************************************************
//
//! Starts initialization the specified RAM sections.
//!
//! \param ramSections is the logical OR of the sections to be initialized.
//!
//! This function starts the initialization of the specified RAM sections. Use
//! MemCfg_getInitStatus() to check if the initialization is done.
//!
//! The \e ramSections parameter is logical OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx or \b MEMCFG_SECT_LSX_ALL
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx or \b MEMCFG_SECT_GSX_ALL
//! - \b MEMCFG_SECT_MSGCPUTOCLA1 and \b MEMCFG_SECT_MSGCLA1TOCPU or
//!   \b MEMCFG_SECT_MSGX_ALL
//! - \b OR use \b MEMCFG_SECT_ALL to configure all possible sections.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_initSections(uint32_t ramSections);

//*****************************************************************************
//
//! Get the status of initialized RAM sections.
//!
//! \param ramSections is the logical OR of the sections to be checked.
//!
//! This function gets the initialization status of the RAM sections specified
//! by the \e ramSections parameter.
//!
//! The \e ramSections parameter is logical OR of one of the following sets of
//! indicators:
//! - \b MEMCFG_SECT_M0 and \b MEMCFG_SECT_M1 or \b MEMCFG_SECT_DX_ALL
//! - \b MEMCFG_SECT_LS0 through \b MEMCFG_SECT_LSx or \b MEMCFG_SECT_LSX_ALL
//! - \b MEMCFG_SECT_GS0 through \b MEMCFG_SECT_GSx or \b MEMCFG_SECT_GSX_ALL
//! - \b MEMCFG_SECT_MSGCPUTOCLA1 and \b MEMCFG_SECT_MSGCLA1TOCPU or
//!   \b MEMCFG_SECT_MSGX_ALL
//! - \b OR use \b MEMCFG_SECT_ALL to get status of all possible sections.
//!
//! \note Use MemCfg_initSections() to start the initialization.
//!
//! \return Returns \b true if all the sections specified by \e ramSections
//! have been initialized and \b false if not.
//
//*****************************************************************************
extern bool
MemCfg_getInitStatus(uint32_t ramSections);

//*****************************************************************************
//
//! Registers an interrupt handler for the RAM access violation interrupt.
//!
//! \param handler is a pointer to the function to be called when the RAM
//! access violation interrupt occurs.
//!
//! This function registers the handler to be called when a RAM access
//! violation interrupt occurs.  This function enables the global interrupt in
//! the interrupt controller; specific RAM access violation interrupts must be
//! enabled via MemCfg_enableViolationInterrupt().  It is the interrupt
//! handler's responsibility to clear the interrupt source via
//! MemCfg_clearViolationInterruptStatus().
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_registerViolationInterrupt(void (*handler)(void));

//*****************************************************************************
//
//! Unregisters an interrupt handler for the RAM access violation interrupt.
//!
//! This function unregisters the handler to be called when a RAM access
//! violation interrupt occurs.  This function also masks off the interrupt in
//! the interrupt controller so that the interrupt handler no longer is called.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_unregisterViolationInterrupt(void);

//*****************************************************************************
//
//! Get the violation address associated with a intFlag.
//!
//! \param intFlag is the type of access violation as indicated by ONE of
//! these values:
//!  - \b MEMCFG_NMVIOL_CPUREAD
//!  - \b MEMCFG_NMVIOL_CPUWRITE
//!  - \b MEMCFG_NMVIOL_CPUFETCH
//!  - \b MEMCFG_NMVIOL_DMAWRITE
//!  - \b MEMCFG_NMVIOL_DMAREAD
//!  - \b MEMCFG_NMVIOL_CLA1READ
//!  - \b MEMCFG_NMVIOL_CLA1WRITE
//!  - \b MEMCFG_NMVIOL_CLA1FETCH
//!  - \b MEMCFG_MVIOL_CPUFETCH
//!  - \b MEMCFG_MVIOL_CPUWRITE
//!  - \b MEMCFG_MVIOL_DMAWRITE
//!
//! \return Returns the violation address associated with the \e intFlag.
//
//*****************************************************************************
extern uint32_t
MemCfg_getViolationAddress(uint32_t intFlag);

//*****************************************************************************
//
//! Registers an interrupt handler for the RAM correctable error interrupt.
//!
//! \param handler is a pointer to the function to be called when the RAM
//! access violation interrupt occurs.
//!
//! This function registers the handler to be called when a RAM correctable
//! error interrupt occurs.  This function enables the global interrupt in the
//! interrupt controller; specific RAM access violation interrupts must be
//! enabled via MemCfg_enableCorrErrorInterrupt().  It is the interrupt handler's
//! responsibility to clear the interrupt source via
//! MemCfg_clearCorrErrorInterruptStatus().
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_registerCorrErrorInterrupt(void (*handler)(void));

//*****************************************************************************
//
//! Unregisters an interrupt handler for the RAM correctable error interrupt.
//!
//! This function unregisters the handler to be called when a RAM correctable
//! error interrupt occurs.  This function also masks off the interrupt in the
//! interrupt controller so that the interrupt handler no longer is called.
//!
//! \sa Interrupt_register() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
extern void
MemCfg_unregisterCorrErrorInterrupt(void);

//*****************************************************************************
//
//! Get the correctable error address associated with a stsFlag.
//!
//! \param stsFlag is the type of error to which the returned address will
//! correspond.  Can currently take the value \b MEMCFG_CERR_CPUREAD only.
//! Other values are reserved.
//!
//! \return Returns the error address associated with the stsFlag.
//
//*****************************************************************************
extern uint32_t
MemCfg_getCorrErrorAddress(uint32_t stsFlag);

//*****************************************************************************
//
//! Get the uncorrectable error address associated with a stsFlag.
//!
//! \param stsFlag is the type of error to which the returned address will
//! correspond. It may be passed one of these values: \b MEMCFG_UCERR_CPUREAD,
//! \b MEMCFG_UCERR_DMAREAD, or \b MEMCFG_UCERR_CLA1READ values.
//!
//! \return Returns the error address associated with the stsFlag.
//
//*****************************************************************************
extern uint32_t
MemCfg_getUncorrErrorAddress(uint32_t stsFlag);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __MEMCFG_H__
